==================
Simple let statement
==================

let x = 1

---

(source_file
  (let_expr
    name: (identifier)
    value: (number)))

==================
Simple var statement
==================

var x = 1

---

(source_file
  (var_expr
    name: (identifier)
    value: (number)))

==================
Function definition
==================

def greet(name):
  let message = "Hello"
  | message
end

---

(source_file
  (def_expr
    name: (identifier)
    parameters: (parameter_list (identifier))
    (let_expr
      name: (identifier)
      value: (pipe
        (string)
        (identifier)))))

==================
Function call
==================

add(1, 2)

---

(source_file
  (call_expr
    function: (identifier)
    arguments: (argument_list
      (number)
      (number))))

==================
Foreach loop
==================

foreach (x, array(1, 2, 3)):
  add(x, 1);

---

(source_file
  (foreach_expr
    variable: (identifier)
    iterable: (call_expr
      function: (identifier)
      arguments: (argument_list
        (number)
        (number)
        (number)))
    (call_expr
      function: (identifier)
      arguments: (argument_list
        (identifier)
        (number)))))

==================
If statement
==================

if (x > 0): x

---

(source_file
  (if_expr
    condition: (group_expr
      (binary_expr
        (identifier)
        (number)))
    body: (identifier)))

==================
Binary expressions
==================

1 + 2 * 3

---

(source_file
  (binary_expr
    (number)
    (binary_expr
      (number)
      (number))))

==================
Pipe expression
==================

x | add(1)

---

(source_file
  (pipe
    (identifier)
    (call_expr
      function: (identifier)
      arguments: (argument_list (number)))))

==================
Array literal
==================

[1, 2, 3]

---

(source_file
  (array
    (number)
    (number)
    (number)))

==================
Dict literal
==================

{name: "test", value: 42}

---

(source_file
  (dict
    (dict_entry
      key: (identifier)
      value: (string))
    (dict_entry
      key: (identifier)
      value: (number))))

==================
Comment
==================

# This is a comment
let x = 1

---

(source_file
  (comment)
  (let_expr
    name: (identifier)
    value: (number)))
