==================
Simple property selector
==================

.property

---

(source_file
  (selector_expr
    property: (identifier)))

==================
Chained property selector
==================

.h.level

---

(source_file
  (selector_expr
    base: (selector_expr
      property: (identifier))
    property: (identifier)))

==================
Array iterator selector
==================

.[]

---

(source_file
  (selector_expr))

==================
Double array iterator selector
==================

.[][]

---

(source_file
  (selector_expr
    base: (selector_expr)))

==================
Chained selector with base
==================

x.h.level

---

(source_file
  (selector_expr
    base: (selector_expr
      base: (identifier)
      property: (identifier))
    property: (identifier)))

==================
Array index selector
==================

x[0]

---

(source_file
  (selector_expr
    base: (identifier)
    index: (number)))
